import '../assets/css/website.css';
import chobImg from '../assets/img/app_Elibrary.png';
import { ArrowRight, Global} from 'iconsax-reactjs';
import Button from '../components/common/button';
import img1 from '../assets/img/E_web_slider1.jpg';
import img2 from '../assets/img/E_web_slider2.jpg';
import img3 from '../assets/img/E_web_slider3.jpg';
import img4 from '../assets/img/E_web_slider4.jpg';

const arrayListItem = [
  'ព័ត៌មានថ្មីៗ – អានព្រះធម៌ និងពិធីបុណ្យថ្មីៗ។',
  'អត្ថបទមានន័យ – ស្វែងរកអត្ថបទដែលផ្តល់ចំណេះដឹង។',
  'វីដេអូអប់រំ – រៀនសូត្រអំពីព្រះធម៌តាមរយៈវីដេអូ។',
  'ពិធីបុណ្យ – ទទួលព័ត៌មានអំពីពិធីសាសនា និងកម្មវិធីនៅវត្ត។',
  'ព័ត៌មានព្រះសង្ឃ – សិក្សាពីជីវិតព្រះសង្ឃ និងការបង្ហាញចំណេះដឹង។',
  'សុវត្ថិភាពអ្នកប្រើ – ចូលប្រើដោយមានការពារ និងផ្ទៀងផ្ទាត់អ្នកប្រើ។',
  'បង្ហោះ និងចែករំលែក – ធ្វើបច្ចុប្បន្នភាពប្រវត្តិរូប និងចែករំលែកអត្ថបទ។',
];
const arrayImagesList =[img1, img2, img3, img4];

export default function WebsitePage({h2 = '', blockquote = '', listItem = '',mainImg = '', imagesList= '', btn = '', flex = false})
{
    const finalList = listItem.length === 0 ? arrayListItem : listItem;
    const finalImags = imagesList.length === 0 ? arrayImagesList : imagesList;
    return (
      <section className="web-build">
          <div className="wbd-box">
               <div className="wbd-con df-s">
                    {/* image */}
                    {flex === true ? 
                    <div className='row-img'>
                        <div className='ri-box'>
                            <img className='img-c' src={mainImg === '' ? chobImg : mainImg} alt="" />
                        </div>
                    </div>
                    : ''}
                    {/* text  */}
                    <div className='row-text'>
                        <div className='rt-box'>
                            <h2 className='df-l'>
                                {h2 === '' ? <> <Global /> គេហទំព័រគ្រប់គ្រងសៀវភៅ </> : h2}
                            </h2>
                            <blockquote>
                                {blockquote === "" ? 
                                <p>
                                    គេហទំព័រនេះត្រូវបានបង្កើតដោយប្រើភាសា Back-end រួមមាន PHP និង Laravel Framework។ វាបានបង្ហោះនៅលើ InfinityFree ក្នុងកំណែទម្រង់៣.០.១៥ ដោយផ្តោតលើសមត្ថភាពប្រតិបត្តិ និងការប្រើប្រាស់ងាយស្រួល។                                    
                                </p>
                                :  blockquote }
                            </blockquote>
                            <ul>
                                {finalList.map((text, index) =>(
                                    <li className="df-l " key={index}>
                                        <i className="fa-solid fa-check"></i>
                                        <p>{text}</p>
                                    </li>
                                    ))
                                }
                            </ul>
                            {btn === '' ? <>
                            <Button element='link' action='https://www.youtube.com/'>
                                ទាញយកកូដ
                                <ArrowRight/>
                            </Button>
                            </>
                            : btn}
                        </div>
                    </div>
                    {/* image */}
                    {flex === false ? 
                    <div className='row-img'>
                        <div className='ri-box'>
                            <img className='img-c' src={chobImg} alt="" />
                        </div>
                    </div>
                    : ''}
                </div>
               <div className="wbdf db-c">
                    <div className="wbdf-box db-c">
                        <ul className="df-s scroll-x">
                            {finalImags.map((img, index) => (
                                <li key={index}>
                                    <img className='img-c' src={img} alt="" />
                                </li> 
                            ))}
                        </ul>
                    </div>
               </div>
          </div>
      </section>
   );   
}

{/* <WebsitePage 
                        mainImg={mainImgUILinkme}
                        blockquote={<p>សូមមើលការបង្កើតថ្មីបំផុតរបស់ខ្ញុំ ដែលបានបង្កើតឡើងដោយប្រើប្រាស់ PHP, HTML, CSS, និង JavaScript! វាមានមុខងារដ៏ពេញនិយម និងអាចបង្កើនបទពិសោធន៍ប្រើប្រាស់បានយ៉ាងល្អ។ អ្នកអាចចូលមើលនៅទីនេះ។</p>}
                        flex = {true}
                        listItem={[
                            '🔐 ចូល/ចុះឈ្មោះ: បង្កើតគណនី និងចូលប្រើប្រព័ន្ធ។',
                            '✍️ បង្កើត, កែប្រែ, លុបតំណ: គ្រប់គ្រងតំណទំនាក់ទំនងរបស់អ្នក។',
                            '📝 បង្កើតការបង្ហោះ: ចែករំលែកគំនិត និងទស្សនៈជាមួយអ្នកដទៃ។',
                            '🤝 តាមដានអ្នកប្រើ: តភ្ជាប់ជាមួយអ្នកប្រើដទៃនៅក្នុងកម្មវិធី។',
                            '👤 គ្រប់គ្រងគណនី: មើល និងគ្រប់គ្រងទំព័រប្រវត្តិរូបរបស់អ្នក។',
                            '👍 ចូលចិត្ត និងរក្សាការបង្ហោះ: អ្នកអាចចូលចិត្ត និងរក្សាការបង្ហោះ។',
                            '🔔 ការជូនដំណឹង: ទទួលបានដំណឹងជាក់ស្តែងតាមពេលវេលា។',
                            '🔍 ស្វែងរកអ្នកប្រើ&ការបង្ហោះ: រកអ្នកប្រើ&ការបង្ហោះបានយ៉ាងលឿន។'
                        ]}
                        imagesList={[imgL1,imgL2,imgL3,imgL4]}
                        h2={<> 🎉 ការណែនាំកម្មវិធីបណ្តាញសង្គម!</>}
                    /> */}

                    {/* this is somepage */}

                    // <section className='school' id='scholl'>
                    //     <div className='sch-box df-s'>
                    //         {/* this Is main show of university */}
                    //         <div className='row'>
                    //             <ul className='df-s'>
                    //                 <li className='df-l'>
                    //                 <div className='lbox'>
                    //                     <div className='lh'>
                    //                         <div className='icon icon-ra icon-sm'>
                    //                             <Profile2User/>
                    //                         </div>
                    //                     </div>
                    //                     <blockquote>
                    //                         <p>មហាវិទ្យាល័យសិល្បៈ មនុស្សសាស្ត្រ និងភាសា</p>
                    //                     </blockquote>
                    //                 </div>
                    //                 </li>
                    //                 <li className='df-l'>
                    //                 <div className='lbox'>
                    //                     <div className='lh'>
                    //                         <div className='icon icon-ra icon-sm'>
                    //                             <Activity/>
                    //                         </div>
                    //                     </div>
                    //                     <blockquote>
                    //                         <p>មហាវិទ្យាល័យគ្រប់គ្រងពាណិជ្ជកម្មនិងទេសចរណ៍</p>
                    //                     </blockquote>
                    //                 </div>
                    //                 </li>
                    //             </ul>
                    //             <ul className='df-s'>
                    //                 <li className='df-l'>
                    //                 <div className='lbox'>
                    //                     <div className='lh'>
                    //                         <div className='icon icon-ra icon-sm'>
                    //                             <Blur/>
                    //                         </div>
                    //                     </div>
                    //                     <blockquote>
                    //                         <p>មហាវិទ្យាល័យកសិកម្មនិងកែច្នៃអាហារ</p>
                    //                     </blockquote>
                    //                 </div>
                    //                 </li>
                    //                 <li className='df-l'>
                    //                 <div className='lbox'>
                    //                     <div className='lh'>
                    //                         <div className='icon icon-ra icon-sm'>
                    //                             <Code/>
                    //                         </div>
                    //                     </div>
                    //                     <blockquote>
                    //                         <p>មហាវិទ្យាល័យវិទ្យាសាស្ត្រនិងបច្ចេកវិទ្យា</p>
                    //                     </blockquote>
                    //                 </div>
                    //                 </li>
                    //             </ul>
                    //             <ul>
                    //                 <li>
                    //                 <div className='lbox df-l'>
                    //                     <div className='lh'>
                    //                         <div className='icon icon-ra icon-sm'>
                    //                             <Cd/>
                    //                         </div>
                    //                     </div>
                    //                     <blockquote>
                    //                         <p>មហាវិទ្យាល័យសង្គមសាស្ត្រនិងអភិវឌ្ឍន៍សហគមន៍</p>
                    //                     </blockquote>
                    //                 </div>
                    //                 </li>
                    //             </ul>
                    //         </div>
                    //         {/* this is show university name */}
                    //         <div className='main'>
                    //             <div className='mb'>
                    //                 <blockquote>
                    //                 <p>NMU - សាកលវិទ្យាល័យជាតិមានជ័យនឹងក្លាយជាសាកលវិទ្យាល័យឈានមុខគេក្នុងការបណ្តុះបណ្តាលធនធានមនុស្សប្រកបដោយគុណភាព និងក្នុងការរួមចំណែកដល់ការអភិវឌ្ឍន៍ប្រទេសជាតិ។</p>
                    //                 </blockquote>
                    //                 <div className='mlogo'>
                    //                 <div className='mlg-box df-l'>
                    //                     <div className='icon icon-ra icon-sm'>
                    //                         <img className='img-c' src={nmuLogo} alt=''/>
                    //                     </div>
                    //                     <div className='text'>
                    //                         <h2>MNU-National Meanchey</h2>
                    //                         <p>Education & University, Cambodia</p>
                    //                     </div>
                    //                 </div>
                    //                 </div>
                    //             </div>
                    //         </div>
                    //     </div>
                    // </section>


{/* this is Elibrary App  */}
                    // <WebsitePage 
                    //     h2={<><DiscountShape size="32" color="#FF8A65"/> Appសម្រាប់គ្រប់គ្រងសៀវភៅ</>}
                    // />



{/* this is Pagoda website  */}
                    // <WebsitePage 
                    //     mainImg={mainImgUIPagoda}
                    //     blockquote={<p>គេហទំព័រនេះត្រូវបានបង្កើតដោយប្រើភាសា Back-end រួមមាន PHP និង Laravel Framework។ វាបានបង្ហោះនៅលើ InfinityFree ក្នុងកំណែទម្រង់៣.០.១៥ ដោយផ្តោតលើសមត្ថភាពប្រតិបត្តិ និងការប្រើប្រាស់ងាយស្រួល។</p>}
                    //     flex = {true}
                    //     listItem={[
                    //         'ព័ត៌មានថ្មីៗ – អានព្រះធម៌ និងពិធីបុណ្យថ្មីៗ។',
                    //         'អត្ថបទមានន័យ – ស្វែងរកអត្ថបទដែលផ្តល់ចំណេះដឹង។',
                    //         'វីដេអូអប់រំ – រៀនសូត្រអំពីព្រះធម៌តាមរយៈវីដេអូ។',
                    //         'ពិធីបុណ្យ – ទទួលព័ត៌មានអំពីពិធីសាសនា និងកម្មវិធីនៅវត្ត។',
                    //         'ព័ត៌មានព្រះសង្ឃ – សិក្សាពីជីវិតព្រះសង្ឃ និងការបង្ហាញចំណេះដឹង។',
                    //         'សុវត្ថិភាពអ្នកប្រើ – ចូលប្រើដោយមានការពារ និងផ្ទៀងផ្ទាត់អ្នកប្រើ។',
                    //         'បង្ហោះ និងចែករំលែក – ធ្វើបច្ចុប្បន្នភាពប្រវត្តិរូប និងចែករំលែកអត្ថបទ។',
                    //     ]}
                    //     imagesList={[imgP1,imgP2,imgP3,imgP4]}
                    //     h2={<><Global /> គេហទំព័រគ្រប់គ្រងព្រះសង្ឃ និងបង្ហោះព៍ត៌មាន!</>}
                    // />